---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralBeamEndSupport
source: html/2caf7495-0855-dbb7-0e74-f97f96902b96.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralBeamEndSupport Property

"Beam End Pocket Seat"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralBeamEndSupport { get; }
```